# Notebook Content
* Dropping Columns
* Dropping Rows
* Various Parameters in Dropping Functionality
* Handling Missing Values by Mean, Median, Mode

In [1]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('Practise').getOrCreate()

23/02/15 01:19:12 WARN Utils: Your hostname, Sujeets-MacBook-Air.local resolves to a loopback address: 127.0.0.1; using 192.168.29.122 instead (on interface en0)
23/02/15 01:19:12 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).

23/02/15 01:19:12 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
23/02/15 01:19:13 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.

In [7]:
df_pyspark = spark.read.csv('test3.csv', header=True, inferSchema=True)

In [8]:
df_pyspark.show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
| Sujeet|  22|        10| 35000|
|  Ajeet|  18|         8| 26000|
|  Akash|  14|         4| 20000|
|  Manoj|  33|         3| 20000|
|Manisha|  37|         1| 15000|
|  Chunu|null|         2| 18000|
| Subham|null|      null| 20000|
|   null|  34|        10| 40000|
|   null|  36|      null|  null|
+-------+----+----------+------+

In [14]:
df_pyspark.drop('Name').show()

+----+----------+------+
| Age|Experience|Salary|
+----+----------+------+
|  22|        10| 35000|
|  18|         8| 26000|
|  14|         4| 20000|
|  33|         3| 20000|
|  37|         1| 15000|
|null|         2| 18000|
|null|      null| 20000|
|  34|        10| 40000|
|  36|      null|  null|
+----+----------+------+

In [15]:
df_pyspark.show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
| Sujeet|  22|        10| 35000|
|  Ajeet|  18|         8| 26000|
|  Akash|  14|         4| 20000|
|  Manoj|  33|         3| 20000|
|Manisha|  37|         1| 15000|
|  Chunu|null|         2| 18000|
| Subham|null|      null| 20000|
|   null|  34|        10| 40000|
|   null|  36|      null|  null|
+-------+----+----------+------+

In [17]:
#dropping null values
df_pyspark.dropna().show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
| Sujeet| 22|        10| 35000|
|  Ajeet| 18|         8| 26000|
|  Akash| 14|         4| 20000|
|  Manoj| 33|         3| 20000|
|Manisha| 37|         1| 15000|
+-------+---+----------+------+

In [19]:
df_pyspark.dropna(how='all').show()
#all tell , it will drop row when all the values in row are null

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
| Sujeet|  22|        10| 35000|
|  Ajeet|  18|         8| 26000|
|  Akash|  14|         4| 20000|
|  Manoj|  33|         3| 20000|
|Manisha|  37|         1| 15000|
|  Chunu|null|         2| 18000|
| Subham|null|      null| 20000|
|   null|  34|        10| 40000|
|   null|  36|      null|  null|
+-------+----+----------+------+

In [24]:
df_pyspark.dropna(thresh=2).show()
# thresh tells - atlest 2 not null values should be present

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
| Sujeet|  22|        10| 35000|
|  Ajeet|  18|         8| 26000|
|  Akash|  14|         4| 20000|
|  Manoj|  33|         3| 20000|
|Manisha|  37|         1| 15000|
|  Chunu|null|         2| 18000|
| Subham|null|      null| 20000|
|   null|  34|        10| 40000|
+-------+----+----------+------+

In [25]:
df_pyspark.dropna(how='any', subset=['Experience']).show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
| Sujeet|  22|        10| 35000|
|  Ajeet|  18|         8| 26000|
|  Akash|  14|         4| 20000|
|  Manoj|  33|         3| 20000|
|Manisha|  37|         1| 15000|
|  Chunu|null|         2| 18000|
|   null|  34|        10| 40000|
+-------+----+----------+------+

In [26]:
df_pyspark.dropna(how='any', subset=['Age']).show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
| Sujeet| 22|        10| 35000|
|  Ajeet| 18|         8| 26000|
|  Akash| 14|         4| 20000|
|  Manoj| 33|         3| 20000|
|Manisha| 37|         1| 15000|
|   null| 34|        10| 40000|
|   null| 36|      null|  null|
+-------+---+----------+------+

In [27]:
# Filling Missing Values

In [38]:
df_pyspark.fillna(value=1001122121, subset=['Experience','Age']).show()

+-------+----------+----------+------+
|   Name|       Age|Experience|Salary|
+-------+----------+----------+------+
| Sujeet|        22|        10| 35000|
|  Ajeet|        18|         8| 26000|
|  Akash|        14|         4| 20000|
|  Manoj|        33|         3| 20000|
|Manisha|        37|         1| 15000|
|  Chunu|1001122121|         2| 18000|
| Subham|1001122121|1001122121| 20000|
|   null|        34|        10| 40000|
|   null|        36|1001122121|  null|
+-------+----------+----------+------+

In [45]:
from pyspark.ml.feature import Imputer

imputer = Imputer(
    inputCols=['Age', 'Experience', 'Salary'], 
    outputCols=["{}_imputed".format(c) for c in ['age', 'Experience', 'Salary']]
    ).setStrategy("mean")

In [46]:
# Add imputation cols to df
imputer.fit(df_pyspark).transform(df_pyspark).show()

+-------+----+----------+------+-----------+------------------+--------------+
|   Name| Age|Experience|Salary|age_imputed|Experience_imputed|Salary_imputed|
+-------+----+----------+------+-----------+------------------+--------------+
| Sujeet|  22|        10| 35000|         22|                10|         35000|
|  Ajeet|  18|         8| 26000|         18|                 8|         26000|
|  Akash|  14|         4| 20000|         14|                 4|         20000|
|  Manoj|  33|         3| 20000|         33|                 3|         20000|
|Manisha|  37|         1| 15000|         37|                 1|         15000|
|  Chunu|null|         2| 18000|         27|                 2|         18000|
| Subham|null|      null| 20000|         27|                 5|         20000|
|   null|  34|        10| 40000|         34|                10|         40000|
|   null|  36|      null|  null|         36|                 5|         24250|
+-------+----+----------+------+-----------+------------------+--------------+

In [49]:
from pyspark.ml.feature import Imputer

imputer = Imputer(
    inputCols=['Age', 'Experience', 'Salary'], 
    outputCols=["{}_imputed".format(c) for c in ['age', 'Experience', 'Salary']]
    ).setStrategy("median")

# Add imputation cols to df
imputer.fit(df_pyspark).transform(df_pyspark).show()

+-------+----+----------+------+-----------+------------------+--------------+
|   Name| Age|Experience|Salary|age_imputed|Experience_imputed|Salary_imputed|
+-------+----+----------+------+-----------+------------------+--------------+
| Sujeet|  22|        10| 35000|         22|                10|         35000|
|  Ajeet|  18|         8| 26000|         18|                 8|         26000|
|  Akash|  14|         4| 20000|         14|                 4|         20000|
|  Manoj|  33|         3| 20000|         33|                 3|         20000|
|Manisha|  37|         1| 15000|         37|                 1|         15000|
|  Chunu|null|         2| 18000|         33|                 2|         18000|
| Subham|null|      null| 20000|         33|                 4|         20000|
|   null|  34|        10| 40000|         34|                10|         40000|
|   null|  36|      null|  null|         36|                 4|         20000|
+-------+----+----------+------+-----------+------------------+--------------+